<!-- dflook/terraform-github-actions {"workspace":"gh-actions-user-2","backend_type":"remote","backend":"5a1046f2eafecd6bd914d6f1b5749018974be17bdcc92d6697a201eff936edf8","plan_job_ref":"Job Test Terraform cloud #173 at https://github.com/dflook/terraform-github-actions/actions/runs/5609975685","plan_hash":"292fe4ea30a23820f4e6a19cd687d83f2b1b319010f66b769507d3edc146f80b","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __gh-actions-user-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #173](https://github.com/dflook/terraform-github-actions/actions/runs/5609975685)